{"artid":"479","arttitle":"VeriFone Commander EMV Rapid Connect Software","artbody":"<p>This article contains all available information concerning the VeriFone Commander EMV Rapid Connect Software.&nbsp; Please check&nbsp;news postings on the front page of Reflex for any updates that become available to this article.&nbsp; &nbsp;<\/p>\r\n<p><span style=\"background-color: #ffff00;\">Please be sure to read this article thoroughly to verify all steps are taken when assisting a site\/tech on this upgrade.&nbsp;<\/span><\/p>\r\n<p><span style=\"color: #ff0000;\"><strong>Guide:<\/strong><\/span><\/p>\r\n<p><a href=\"upload\/docs\/VASC Playbook for Valero EMV 08.2017.pdf\" target=\"_blank\">VASC Playbook for Valero EMV<\/a><\/p>\r\n<p><strong><span style=\"color: #ff0000;\">Additional Support Documents:<\/span><\/strong><\/p>\r\n<p><a href=\"upload\/auto-upgrade09152016.pdf\" target=\"_blank\">Auto Upgrade<\/a><\/p>\r\n<p><a href=\"upload\/sales-bulletin-fd-emv-transition-team-valero-v2.pdf\" target=\"_blank\">Sales Bulletin<\/a><\/p>\r\n<p><a href=\"upload\/fd-network-conversion.pdf\" target=\"_blank\">FD Network Conversion <\/a><\/p>\r\n<p><span style=\"text-decoration: underline;\"><span style=\"background-color: #ffff00;\"><strong>Update 10\/02\/17:<\/strong><\/span><\/span><\/p>\r\n<p>Please <a href=\"upload\/vlr-rapidconnect-buildmaster-modified.xlsx\" target=\"_blank\">click here<\/a> for a list of TNSLink routers that were not active at the time TNS remotely deployed the routing changes to support Rapid Connect.&nbsp; <span style=\"color: #ff0000;\">If a site on the list calls in to report issues connecting to Rapid Connect<\/span>, please follow the instructions below (previously provided).<\/p>\r\n<p><span style=\"color: #000000;\">Send an email to:&nbsp;<\/span><a href=\"mailto:globalbroadband@tnsi.com\">globalbroadband@tnsi.com<\/a>&nbsp;<\/p>\r\n<p><strong>Subject line:<\/strong>&nbsp; Verifone EMV\/Rapid Connect Conversion Connectivity Issue<\/p>\r\n<p>&nbsp;<\/p>\r\n<p><strong>Body Contents:<\/strong><\/p>\r\n<p>&nbsp;<\/p>\r\n<p>TNS Router ID:&nbsp;<\/p>\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <em>IE:&nbsp; VLRJOBBERDEALER<\/em><\/p>\r\n<p>&nbsp;<\/p>\r\n<p><span style=\"color: #ff0000;\"><em>**Note: No Change to remainder &ndash; please include as-is**<\/em><\/span><\/p>\r\n<p>&nbsp;<\/p>\r\n<p>The site referenced above has had the commander updated to redirect Transaction Authorizations to ONE of the following 2 FDC &ldquo;Rapid Connect&rdquo; Hosts:<\/p>\r\n<p>&nbsp;<\/p>\r\n<p>204.194.127.203 (fdc50a-host-79) &ndash; Verifone configured<\/p>\r\n<p>204.194.139.203 (fdc50a-host-80)<\/p>\r\n<p>&nbsp;<\/p>\r\n<p>TNS router should include a NAT to each of the above FDC Hosts and ACL Permits from 172.16.20.x.<\/p>\r\n<p>Commander IP&rsquo;s will be as follows:<\/p>\r\n<p>VLR Direct Clients: &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 172.16.20.12 (host-1)<\/p>\r\n<p>VLR Branded Clients: &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; wrs, vps, gpmi: 172.16.20.135 (host-135)<\/p>\r\n<p>fsm: 172.16.20.235 (host-235)<\/p>\r\n<p>&nbsp;<\/p>\r\n<p><span style=\"text-decoration: underline;\"><span style=\"background-color: #ffff00;\"><strong>Update 9\/15\/17:<\/strong><\/span><\/span><\/p>\r\n<p>If you get a site that is switching from any Point of Sale to a Commander\/Rapid connect,&nbsp; you will need to request a new merchant id from Mitzi.&nbsp;&nbsp; The id's&nbsp;<span style=\"background-color: #ffff00;\"><strong>CANNOT<\/strong><\/span> be flipped.&nbsp; Please contact Mitzi as soon as possible to get the request in.&nbsp;<\/p>\r\n<p><span style=\"text-decoration: underline; background-color: #ffff00;\"><strong>Update 8\/29\/17:<\/strong><\/span><\/p>\r\n<p>The wholesale communications team will be emailing the attached documents to our distributors this week and posting them on the Wholesale portal.&nbsp; Verifone has offered to assist sites during business hours with configuring the EMV settings.&nbsp; The attached Sales Bulletin provides the steps sites will need to follow.&nbsp; In addition to the Sales Bulleting, we will be emailing the Auto Upgrade document.<\/p>\r\n<p>Steps at a high level:<\/p>\r\n<ul>\r\n<li>Sites will need to request a software upgrade to 3.02.34 via <a href=\"http:\/\/support.verifone.com\/\">http:\/\/support.verifone.com<\/a> , see the detailed steps in the Sales Bulletin\r\n<ul>\r\n<li>Site has to have an active ASM contract<\/li>\r\n<li>Site has to have connectivity to Verifone&rsquo;s Remote Software Delivery (VRSD) server\r\n<ul>\r\n<li>The commander communicates to VRSD through the EZR<\/li>\r\n<\/ul>\r\n<\/li>\r\n<li>Site will process credit on terminal 001 on ATL105 until EMV conversion is completed by Verifone<\/li>\r\n<li>If sites do not know their service ID, see article 463<\/li>\r\n<\/ul>\r\n<\/li>\r\n<li><span style=\"background-color: #ffff00;\">Once software upgrade is complete, site will need to visit support.verifone.com to request EMV configuration assistance from Verifone, see the detailed steps in the Sales Bulletin<\/span><\/li>\r\n<ul>\r\n<li>Verifone will work directly with the site on scheduling a date and time to complete the configuration (terminal 002)<\/li>\r\n<li>There are two document links presented on <a href=\"http:\/\/support.verifone.com\/\">http:\/\/support.verifone.com<\/a>, one provides guidance on where to locate the information requested by Verifone (FD Network Conversion, attached), the other document is a generic sales bulletin (not attached)<\/li>\r\n<\/ul>\r\n<\/ul>\r\n<p>I have also attached a document that has images of support.verifone.com, please let me know if additional information is needed.<\/p>\r\n<p><span style=\"text-decoration: underline; background-color: #ffff00;\"><strong>Update 08\/15\/17:<\/strong><\/span><\/p>\r\n<p>We have asked Verifone to release the Commander EMV software (3.02.34) to production. &nbsp;The announcement to our branded distributors will go out 08\/15\/17.&nbsp; Linked above is an update reference guide that will be provided to Verifone installers.&nbsp; This guide replaces all previous documents.&nbsp; This software will only support inside EMV.<\/p>\r\n<p>It is very likely that the VASCs will call the help desk for support.&nbsp; Please make sure to reference the attached document to answer questions. &nbsp;<br \/>Here are some important&nbsp;items concerning the upgrade:<\/p>\r\n<ul>\r\n<li>All sites will use terminal 002 for Rapid Connect<\/li>\r\n<li>The VASC will only need to configure a host specific route for Rapid Connect<\/li>\r\n<\/ul>\r\n<p>All service providers have made the necessary changes to support the new routes to Rapid Connect.&nbsp;<\/p>\r\n<p><span style=\"color: #ff0000;\"><strong><a id=\"stuff\"><\/a>***Additional Steps Required***:<\/strong><\/span><\/p>\r\n<p>Issues have been identified with the First Data merchant profile setup on <span style=\"color: #ff0000;\">terminal 002<\/span>.&nbsp; Please make the following corrections, then set site for a PDL and validate it pulls successfully.&nbsp; First Data has been notified.<\/p>\r\n<p><strong>Step 1: Update Day Close Password<\/strong><\/p>\r\n<ol>\r\n<li>Log in to Clientline and go to <span style=\"color: #ff0000;\">Profile Maintenance<\/span> &gt; <span style=\"color: #ff0000;\">Merchant Setup<\/span> &gt; <span style=\"color: #ff0000;\">Settlement\/Other Info. tab<\/span>.&nbsp; <br \/><br \/><\/li>\r\n<li>You will see the field labeled \"<span style=\"color: #ff0000;\">Password<\/span>\" in the right hand column.&nbsp; Replace the 123456 with 111111 in this field and press \"<span style=\"color: #ff0000;\">Update<\/span>\" at the bottom right hand side of the page.&nbsp;<\/li>\r\n<\/ol>\r\n<p><strong>Step 2: Update Card Settings <\/strong><\/p>\r\n<ol>\r\n<li>Navigate to <span style=\"color: #ff0000;\">Terminal Setup<\/span> &gt; <span style=\"color: #ff0000;\">Search Terminal<\/span>.&nbsp; Enter in the store's MID and use <span style=\"color: #ff0000;\">2<\/span> for the Terminal No.<br \/><br \/><\/li>\r\n<li>Click on the <span style=\"color: #ff0000;\">Cards Accepted<\/span> tab<br \/><br \/><\/li>\r\n<li>Enable Velocity for Proprietary Card 1<br \/><br \/><\/li>\r\n<li>Enable Buypass Fleet (leave the Velocity box unchecked)<br \/><br \/><\/li>\r\n<li>Enable Diners and check option for velocity.<\/li>\r\n<\/ol>\r\n<p><strong><img src=\"upload\/cards-accepted-tab - updated.png\" alt=\"\" width=\"856\" height=\"469\" \/><\/strong><\/p>\r\n<p><strong>Step 3: Update Velocity Settings<\/strong><\/p>\r\n<ol>\r\n<li>Navigate to <span style=\"color: #ff0000;\">Velocity<\/span> &gt; <span style=\"color: #ff0000;\">Update Velocity<br \/><br \/><\/span><\/li>\r\n<li>Update Velocity parameters on <span style=\"color: #ff0000;\">terminal 002<\/span> &ndash; should be 2\/200 for<span style=\"color: #ff0000;\"> line 1.&nbsp; <span style=\"color: #000000;\">Enter following amounts and the hit \"<span style=\"color: #ff0000;\">Add<\/span>\"<\/span><\/span><span style=\"color: #000000;\">:<\/span><br \/><br \/>\r\n<ol>\r\n<li>Daily Count - 2<\/li>\r\n<li>Daily Amount - 200.0<\/li>\r\n<li>Period Count - 2<\/li>\r\n<li>Period Amount - 200.0<\/li>\r\n<\/ol>\r\n<\/li>\r\n<\/ol>\r\n<p><span style=\"background-color: #ffff00;\"><img src=\"upload\/velocity.png\" alt=\"\" width=\"876\" height=\"143\" \/><br \/><\/span><\/p>\r\n<p>&nbsp;<\/p>\r\n<p>&nbsp;<\/p>","createstamp":"2017-08-15 05:18:44","usercreate":"l7d23b","modstamp":"2017-12-20 09:07:37","usermod":"ln524h","pubflag":"yes","rfcflag":"no","comment":"","usercomment":"","commentstamp":"0000-00-00 00:00:00","summary":"Verifone Commander EMV Software","triggers":"","chainid":"10010","rolename":"Tech Support 1","encflag":"N","linkdoctext":"\r\n Owner TNS Router ID Status VLR apo00015v apo00016v apo00017v apo00018v apo00021v apo00024v apo00025v apo00026v apo00027v apo00028v apo00029v apo00030v apo00031v apo00032v apo00033v bes00002v bke00004v bpl00010v bpl00011v bru00001v cay00003v cay00020v cay00043v cay00044v cay00045v cay00047v cay00048v csg00005v ctp00033v ctp00043v ctp00044v ctp00047v ctp00057v dco00005v dco00006v dco00007v dfp00009v dnv00001v dso00001v dso00007v dso00009v dso00011v dso00012v dso00013v dso00022v dso00023v dso00024v epr00055v eve00004v fcr00003v fto00011v fxo00001v fxo00002v geg00001v gpp00001v hmp00004v jms00007v lei00002v los00001v mge00007v mge00022v mge00055v mrk00002v mrk00003v nod00007v nod00008v nod00011v nod00012v nod00013v nzr00002v ond00003v ond00004v pai00003v pep00007v que00001v rce00001v ric00001v roo00006v roo00008v rro00002v rro00004v sbl00007v sbo00001v spa00031v spr00007v spr00011v srk00013v srk00021v srk00024v srn00027v srn00029v srn00046v srn00049v tbr00019v tcn00005v tcn00010v txn00003v txn00009v vao00002v wby00010v wby00013v wby00018v wfl00007v wfl00017v wfl00029v Configured Customer Hold Designed vlr0189530502v vlr0189530387v vlr0189530619v vlr0189530494v vlr0189532961v vlr0189530486p vlr0189523838v vlr0189530429v vlr0189530411v vlr0189523853v vlr0189524646v vlr0189514738v vlr0189530437v vlr0189530569v vlr0189530460v vlr0395598881v vlr0345035915v vlr0950011278v vlr0950011279v This jobber flip flopped equipment for vlr0950011279v and vlr0950011281v. We hae not gotten confirmatin of what should be up \/ disconnected and which serial number is at which location vlr2100773486v vlr1070094961v vlr1070099204v vlr1070010281v vlr1070010216v vlr1070010366v vlr1070111468v vlr1070111467v vlr1450011393v vlr7407546805v We were told site was closed \"temporarily\" on 5\/15\/17 vlr7407546748v vlr7407599274v vlr7407572736v vlr7407510100v vlr2646010048v vlr2646038042v vlr2646042945v vlr2410099079v vlr7831075101v vlr2465011049v vlr2465011331v vlr2465011300v Router came up and then went down. Nate Berdon tried to call the location, but it is a fax line vlr2465011303v vlr2465011308v vlr2465011310v vlr2465078535v vlr2465011387v vlr2465099923v vlr2820099312v vlr2720011357v vlr3190099600v vlr0483290977v vlr0497447165v vlr0497446472v vlr4110010737v vlr3695042036v vlr3900011209v vlr0504110589v vlr4460010703v vlr4820099628v Per Justin Stallings: Site is not ready to open yet vlr4880511249v Router came up in May and then went unreachable. NO feedback as to whether Valero Helpdesk was able to get infroatmion vlr2922010519v Jobber is not responding to Valero Helpdesk vlr2922010534v We were told site was Temporarily closed vlr2922011324v vlr2710011417v vlr2710011416v vlr5480097170v vlr5480097089v They moved this equipment from one location to another and it has been unreachable vlr5480097261v vlr5480097030v vlr5480096966v vlr5495099222v vlr5496046375v vlr5496048348v vlr5690086231v vlr7772510442v This was installed in July and then a few days later went unreachable vlr7955038257v vlr3685071993v vlr0497010674v vlr0415199366v vlr0415199477v vlr6290002261v vlr6290011429v vlr6680099719v We were told that the location is closed and they are trying to find a new owner vlr0600099822v vlr7677011448v vlr4700074054v vlr4700011390v vlr4520087379v vlr4520099399v vlr4520099978v vlr1070111128v vlr1070111127v vlr1070198908v vlr1070198843v vlr7560099587v vlr7577027730v vlr7532550849v vlr7577011431v vlr7532553066v vlr7977011410v<t xml:space=\"preserve\">This was installed and then went unreachable a few days later. Per Valero Help desk - none of the numbers to this location are working.  vlr7857010267v vlr7857010426v vlr7857010113v vlr0504110738v vlr0504199208v Valero Site IDmailto:globalbroadband@tnsi.comhttp:\/\/support.verifone.com\/http:\/\/support.verifone.com\/"}